In [9]:
import pandas as pd

data = ['4 cups', '1 cup', '2 large', '1 can']
index= ['Flour', 'Milk', 'Eggs', 'Spam']
dinner = pd.Series(data, index=index, name= 'Dinner')
dinner

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [3]:
import pandas as pd

index = ['2018', '2019', '2020', '2021']

data = {
    '영희': [143, 150, 157, 160],
    '철수': [165, 172, 175, 180]
}

growth = pd.DataFrame(data, columns=['영희', '철수'], index=index)
growth
growth.astype('float')
growth.astype({'영희': 'float'})

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [8]:
import pandas as pd

# fruits = pd.Series({
#     'Apples': 30,
#     'Bananas': 21
# })

fruits = pd.DataFrame({
    'Apples': [30],
    'Bananas': [21]
})

fruits

   Apples  Bananas
0      30       21

In [ ]:
import pandas as pd

data = {
    'Apples': [35, 21],
    'Bananas': [41, 34],
}

fruits = pd.DataFrame(data, index = ['2017 Sales', '2018 Sales'])
fruits

In [11]:
animals = pd.DataFrame(
    {'Cows': [12, 20], 'Goats': [22, 19]}, 
    index=['Year 1', 'Year 2']
)
animals

animals.to_csv('datas/cows and goats.csv')

In [16]:
import pandas as pd

temperature = pd.read_csv("datas/cows and goats.csv", index_col = 0)
temperature

        Cows  Goats
Year 1    12     22
Year 2    20     19

In [27]:
import pandas as pd

헬스장회원 = pd.DataFrame({
    '회원번호': ['102365', '206587', '185365', '589655'],
    '성별': ['남', '여', '', '남'],
    '이름': ['김기용', '장성화', '이정훈', '한성년'] 
})
# print(헬스장회원)
헬스장회원2 = 헬스장회원.set_index('회원번호')
print(헬스장회원2)
print(헬스장회원2['성별'])

       성별   이름
회원번호
102365  남  김기용
206587  여  장성화
185365     이정훈
589655  남  한성년
회원번호
102365    남
206587    여
185365
589655    남
Name: 성별, dtype: object
회원번호
102365    False
206587     True
185365    False
589655    False
Name: 성별, dtype: bool
       성별   이름
회원번호
206587  여  장성화

In [33]:
import pandas as pd

헬스장회원 = pd.DataFrame({
    '회원번호': ['102365', '206587', '185365', '589655'],
    '성별': ['남', '여', '', '남'],
    '이름': ['김기용', '장성화', '이정훈', '한성년'] 
})
# print(헬스장회원)
헬스장회원2 = 헬스장회원.set_index('회원번호')
print(헬스장회원2)
# 헬스장회원2.loc['185365']['성별'] = '여'
# print(헬스장회원2)

       성별   이름
회원번호
102365  남  김기용
206587  여  장성화
185365     이정훈
589655  남  한성년